//
//	星
//

#include	"main.h"

//--- 定数定義 ------------------------------------------------------
#define	STAR_START		70.0f		// 星のスタート位置
#define	STAR_END		-70.0f		// 星の終了位置
#define FADE_IN_SPEED	0.01f		// 登録時のフェードイン

//--- 変数定義 ----------------------------------------------------------
cStar	*star;

/*-------------------------------------------------------------*
|	<<< 初期化 >>>
*--------------------------------------------------------------*/
void	cStar::Init(void)
{
	//m_vecPos.y	= STAR_END;				// こうしておくことで、Main関数内で座標の再計算をしてくれる
	//m_vecSpeed	= VEC3(0,	0,	0);		// 速度
	m_fAlp		= 0;					// アルファ値

	//初期座標(X Y Z をランダムで配置する)
	float	fX	= FRAND2(-10.0f,	+10.0f);
	float	fY	= FRAND2(STAR_END,	STAR_START);
	float	fZ	= FRAND2(-10.0f,	+10.0f);
	m_vecPos	= VEC3(fX,	fY,	fZ);

	// 速度
	m_vecSpeed.x = 0;			// 速度も適当に設定
	m_vecSpeed.y = FRAND2(0.1f, 0.3f);
	m_vecSpeed.z = 0;


}

/*-----------------------------------------------------------------*
| <<< 星 >>>
*------------------------------------------------------------------*/
void	cStar::Main(void)
{
	//--- 移動 ------------------------------------------
	m_vecPos.y -= m_vecSpeed.y;

	// 画面の下端で見切られたか？
	if(m_vecPos.y <= STAR_END)
	{
		// 速度を再計算
		m_vecPos.x		= FRAND2( -10.0f, +10.0f);
		m_vecPos.y		= STAR_START;
		m_vecPos.z		= FRAND2(-10.0f, +10.0f);
		m_vecSpeed.y	= FRAND2(	0.1f,	0.3f);
		m_fAlp			= 0;
	}
	//--- 半透明レート計算 ------------------------------------
	VALUE_TO_TARGET(m_fAlp, 1.0f, FADE_IN_SPEED);

	//--- 行列計算 --------------------------------------------
	D3DXMatrixTranslation(&m_mtxWorld, &m_vecPos);	// 平行移動
}
/*---------------------------------------------------------------*
| <<< 描画 >>>
*----------------------------------------------------------------*/
void	cStar::Draw(void)
{
	d3_3d_draw(X_STAR, &m_mtxWorld, m_fAlp);
}
//--- 以下、一括処理 -------------------------------------------------
/*-----------------------------------------------------------*
| <<< 星初期化 >>>
*-----------------------------------------------------------*/
void	StarInit(void)
{
	// メモリ確保
	if(star == NULL)
	{
		star = new cStar[STAR_MAX];
	}
	// 初期化
	for(int i = 0; i < STAR_MAX; i++)
	{
		star[i].Init();
	}
}

/*----------------------------------------------------------*
| <<< 星メイン >>>
*-----------------------------------------------------------*/
void	StarMain(void)
{
	for(int i = 0; i < STAR_MAX; i++)
	{
		star[i].Main();
	}
}

/*--------------------------------------------------------*
| <<< 星描画 >>>
*---------------------------------------------------------*/
void	StarDraw(void)
{
	d3_stat_alpha_set(true);		// 半透明オン
	for(int	i = 0; i < STAR_MAX; i++)
	{
		star[i].Draw();
	}
}
	
