//
//	マウスdeシューティング雛形
//
//

#include	"main.h"


//--- 定数定義 ------------------------------------------------------------------------------------
//--- 変数定義 ------------------------------------------------------------------------------------

GAME_WORK	game = {MODE_TITLE};			// 開始モードは MODE_TITLE

/*------------------------------------------------------------------------------*
| <<< ゲーム初期化 >>>
*------------------------------------------------------------------------------*/
void	game_init(void)
{
	//--- テクスチャー ---------------------------------------------------------
	FOLDER_SET("画像");
	d3_tex_load(TEX_MOJI,		"文字.png");
	d3_tex_load(TEX_TITLE,		"タイトル.png");
	d3_tex_load(TEX_INFO,		"説明.png");
	d3_tex_load(TEX_OVER,		"ゲームオーバー.png");

	//--- 3Dモデル読み込み -----------------------------------------------------
	FOLDER_SET("3Dモデル");
	d3_xfile_load(X_PLAYER,	"player.mqo");
	d3_xfile_load(X_GROUND,	"ground.mqo");
	d3_xfile_load(X_SHOT,	"shot.mqo");
	d3_xfile_load(X_ENE00,	"ene00.mqo");
	d3_xfile_load(X_ENE01,	"ene01.mqo");
	d3_xfile_load(X_ENE02,	"ene02.mqo");

	//--- 音楽 & 効果音 --------------------------------------------------------
	FOLDER_SET("サウンド");
	snd_load(SND_START, "start.wav", false);//ゲーム開始
	snd_load(SND_SHOT,	"shot.wav",	 false);//ショット
	snd_load(SND_BOMB,	"bomb.wav",	 false);//爆発

	//--- いろいろ初期化 -------------------------------------------------------
	// カメラ設定(真上にする)
	d3.vecCamera		= VEC3(0,	7,	-0.1f);
	// ライト
	d3.light.Direction  = VEC3(0,  -5,	-1);

}



/*------------------------------------------------------------------------------*
| <<< ゲームメイン >>>
*------------------------------------------------------------------------------*/
void	game_main(void)
{
	d3_render_begin();						// レンダリング開始
	PrintfInit();							// 文字表示初期化
	Camera();								// カメラ

	switch(game.iMode)
	{
	//--- タイトル ----------------------------------------------------------------
	case MODE_TITLE:
		Title(TEX_TITLE, &game.iMode, MODE_INFO, SND_SHOT);
		break;

	//--- 説明 --------------------------------------------------------------------
	case MODE_INFO:
		if(Title(TEX_INFO, &game.iMode, MODE_GAME, SND_START))
		{
			PlayerInit();					// プレイヤー初期化
		}
		break;

	//--- ゲーム ------------------------------------------------------------------
	case MODE_GAME:
		PlayerInit();					// プレイヤーメイン
		PlayerDraw();					// プレイヤー描画
		break;
	}
	PrintfFlush();							// 文字書き出し
	d3_render_end();						// レンダリング終了
}


/*------------------------------------------------------------------------------*
| <<< ゲーム終了 >>>
*------------------------------------------------------------------------------*/
void	game_end(void)
{
}


