
//--- アプリ名 -----------------------------------------------------------------------------------
#define	APP_NAME	"マウスdeシューティング"		// アプリ名
#define	VERSION		""								// バージョン情報

//--- 定数を定義 ----------------------------------------------------------------------------------
#define ENEMY_MAX	100			// エネミーの最大数
#define ENEMY_KIND	3			// エネミーの種類
//--- モード --------------------------------------------------------------------------------------
enum	MODE_ID
{
	MODE_TITLE,				// 0 : タイトル
	MODE_INFO,				// 1 : 説明
	MODE_GAME,				// 2 : ゲーム
	MODE_OVER,				// 3 : ゲームオーバー
};

//--- テクスチャー --------------------------------------------------------------------------------
enum	TEX_ID
{
	TEX_MOJI,
	TEX_TITLE,
	TEX_INFO,
	TEX_OVER,
};

//--- サウンド番号 --------------------------------------------------------------------------------
enum	SND_ID
{
	SND_SHOT,
	SND_BOMB,
	SND_START,
};

//--- Ｘファイル ----------------------------------------------------------------------------------
enum	X_ID
{
	X_GROUND,
	X_PLAYER,
	X_SHOT,
	X_ENE00,
	X_ENE01,
	X_ENE02,
};

//--- インクルードファイル ------------------------------------------------------------------------
#include	"Game.h"

#include	"Camera.h"
#include	"Printf.h"
#include	"Title.h"
#include	"Player.h"