//
// フォントをテクスチャーへ展開
//

#ifndef	__FONT_TO_TEXTURE_H

#define	__FONT_TO_TEXTURE_H


/*------------------------------------------------------------------------------*
| <<< テクスチャーにアウトラインフォントを作成 >>>
|	入力	iTex        = 文字を作成するテクスチャー番号
|			iX, iY		= 文字の表示座標
|			strFontName = TrueType フォント名
|			str		    = 描画文字
|			iHeight     = フォント高
|			iWidth      = フォントの横幅
|			bItalic		= TRUE: 斜体
|			iPenSize    = アウトラインの太さ(ピクセル)
|			dwEdge      = アウトラインの色
|			dwFill      = 塗りつぶし色
|			iQuality    = アンチエイリアス精度( 1 以上の値にすること)
*------------------------------------------------------------------------------*/
extern	void	font_to_texture(int iTex, int iX, int iY, char *strFontName, int iHeight, int iWidth, BOOL bItalic, int iPenSize, DWORD dwEdge, DWORD dwFill, int iQuality, char* Format,...);

/*------------------------------------------------------------------------------*
| <<< テクスチャーをクリア >>>
|	入力	iTex = クリアするテクスチャー
*------------------------------------------------------------------------------*/
extern	void	font_to_texture_clear(int iTex);

/*------------------------------------------------------------------------------*
| <<< 描画終了座標を得る >>>
|	戻り値	描画終了座標 X
*------------------------------------------------------------------------------*/
extern	int		font_to_texture_get_next_x(void);

/*------------------------------------------------------------------------------*
| <<< 描画終了座標を得る >>>
|	戻り値	描画終了座標 Y
*------------------------------------------------------------------------------*/
extern	int		font_to_texture_get_next_y(void);

#endif					// end _font_to_texture.h

