//
//	ムービーをテクスチャーに流し込むプログラム
//
//	使用の際には『main.h』内で
//
//		#define	__MOVIE				1		// 1 : ムービー使用
//
//	としてください


//--- 以下、簡単な使用例です。 --------------------------------------------------------------------

//	void	game_init(void)
//	{
//		FOLDER_SET("任意のフォルダー");
//		move_to_texture_load(1, "ムービー.avi");		// 特殊なフォーマットの場合、デコーダーをインストのこと
//	}													// 1 番のテクスチャーへ転送

//	void	game_main(void)
//	{
//		if(pad.bLeftClick){ movie_to_texture_play(1, -1);	// 再生開始、無限回ループ
//		static	bool	bPause = true;						// 一時停止
//		if(pad.bRightClick){ movie_to_texture_pause(bPause); bPause ^= 1;}
//		D3_TEXTURE(1);										// 描画
//		D3_2DDRAW(&VEC2(0, 0), &VEC2(640, 480), 0, 1, 1, 0, D3_COL_NORMAL);
//	}

//	void	game_end(void)
//	{
//		movie_to_texture_free(1);						// 終了の際は解放のこと(特別やらなくても、アプリ終了の際にはシステム側でもやっています)
//	}


//--- 関数一覧 ------------------------------------------------------------------------------------

/*------------------------------------------------------------------------------*
| <<< ムービーをメモリより解放 >>>
|	int	iNum  = -1 : 全て開放							※ D3_TEX_MAX2 個まで
|		     != -1 : 指定番号のムービーを開放
*------------------------------------------------------------------------------*/
extern	void	movie_to_texture_free(int iNum);

/*------------------------------------------------------------------------------*
| <<< ムービーの読み込み >>>
|	入力	iNum    = ムービー管理番号(テクスチヤー番号)	※ D3_TEX_MAX2 個まで
|			strFile = ファイル名
|			b16Bit  = 16 ビットでテクスチャーに流し込む
*------------------------------------------------------------------------------*/
extern	bool	movie_to_texture_load(int iNum, char *strFile, bool b16Bit);

/*------------------------------------------------------------------------------*
| <<< ムービーの読み込み >>>
|	入力	iNum  =	ムービー管理番号(テクスチヤー番号)	※ D3_TEX_MAX2 個まで
|			strFile = ファイル名
*------------------------------------------------------------------------------*/
extern	bool	movie_to_texture_load(int iNum, char *strFile);

/*------------------------------------------------------------------------------*
| <<< 再生速度設定 >>>
|	入力	iNum  =	ムービー管理番号(テクスチヤー番号)	※ D3_TEX_MAX2 個まで
|			fRate = 1.0f : 等速
|					2.0f : 二倍速
|					0.5f : 1/2 倍速
*------------------------------------------------------------------------------*/
extern	void	movie_to_texture_play_rate_set(int iNum, float fRate);

/*------------------------------------------------------------------------------*
| <<< ムービーテクスチャーに流し込み再生 >>>
|	入力	iNum  =	ムービー管理番号(テクスチヤー番号)	※ D3_TEX_MAX2 個まで
|			iLoop =	ループ数				※-1で無限
*------------------------------------------------------------------------------*/
extern	bool	movie_to_texture_play(int iNum, int iLoop);

/*------------------------------------------------------------------------------*
| <<< サウンド設定 >>>					※再生中は変更不可、movie_to_texture_play 前で設定のこと
|	入力	iNum = ムービー管理番号(テクスチヤー番号)	※ D3_TEX_MAX2 個まで
|			bSw  = true  : サウンド再生
|				   false : サウンド再生しない	※デフォルト
*------------------------------------------------------------------------------*/
extern	void	movie_to_texture_sound_set(int iNum, bool bSw);

/*------------------------------------------------------------------------------*
| <<< ムービーの一時停止 >>>
|	入力	iNum = ムービー管理番号(テクスチヤー番号)	※ D3_TEX_MAX2 個まで
|			bSw  = true  : ポーズをかける
|				   false : ポーズ解除
*------------------------------------------------------------------------------*/
extern	void	movie_to_texture_pause(int iNum, bool bSw);

/*------------------------------------------------------------------------------*
| <<< 全ムービーの一時停止 >>>
|	入力	bSw = true  : ポーズをかける
|				  false : ポーズ解除
*------------------------------------------------------------------------------*/
extern	void	movie_to_texture_pause_all(bool bSw);

/*------------------------------------------------------------------------------*
| <<< システムが使用する全ムービーの一時停止(非アクティブ時に使用) >>>
|	入力	bSw = true  : ポーズをかける
|				  false : ポーズ解除
*------------------------------------------------------------------------------*/
extern	void	movie_to_texture_system_pause(bool bSw);

/*------------------------------------------------------------------------------*
| <<< ムービー停止 >>>
|	入力	iNum = ムービー管理番号(テクスチヤー番号)	※ D3_TEX_MAX2 個まで
|	※	pause は一時停止、stop は停止となります。
*------------------------------------------------------------------------------*/
extern	void	movie_to_texture_stop(int iNum);

/*------------------------------------------------------------------------------*
| <<< 全ムービー停止 >>>
*------------------------------------------------------------------------------*/
extern	void	movie_to_texture_stop_all(void);

/*------------------------------------------------------------------------------*
| <<< ムービーが終了したか調べる >>>
|	入力	iNum = ムービー管理番号(テクスチヤー番号)	※ D3_TEX_MAX2 個まで
|	戻り値	true : 終了している
*------------------------------------------------------------------------------*/
extern	bool	movie_to_texture_status_check(int iNum);

/*------------------------------------------------------------------------------*
| <<< ムービーのサイズを得る >>>
|	入力	iNum     = ムービー管理番号(テクスチヤー番号)	※ D3_TEX_MAX2 個まで
|	出力	*piWidth = 横幅
|			*piHeight = 縦幅
*------------------------------------------------------------------------------*/
extern	void	movie_size_get(int iNum, int *piWidth, int *piHeight);

/*------------------------------------------------------------------------------*
| <<< ムービーのメイン処理 >>>
|	※ ムービー再生時は game_main で一度呼び出しのこと
*------------------------------------------------------------------------------*/
extern	void	movie_to_texture_main(void);

/*------------------------------------------------------------------------------*
| <<< 再生位置を変更する >>>
|	入力	iNum   = ムービー管理番号(テクスチヤー番号)	※ D3_TEX_MAX2 個まで
|			llTime = 時間
*------------------------------------------------------------------------------*/
extern	void	movie_to_texture_pos_set(int iNum, LONGLONG llTime);

/*------------------------------------------------------------------------------*
| <<< ムービーの音量設定 >>>
|	入力	iNum = ムービー管理番号(テクスチヤー番号)	※ D3_TEX_MAX2 個まで
|			fVol = 音量(0.0f ～ 1.0f(最大(default))
*------------------------------------------------------------------------------*/
extern	void	movie_to_texture_volume(int iNum, float fVol);
