
#ifndef	__META_H
#define	__META_H


//--- 構造体 --------------------------------------------------------------------------------------
extern	void	*meta_visible_func;		// 可視状態情報を得る時に使用
extern	void	*meta_obj_name_func;	// オブジェ名を得る時に使用


/*-------------------------------------------------------------------------------*
| <<< メタセコファイル読み込み >>>
|	入力	iNum	 = 読み込みbr番号
|			strFile  = 読み込みMQOファイル名
|	戻り値	true or	false
*-------------------------------------------------------------------------------*/
extern	BOOL	meta_load(int iNum, char *strFilep);

/*-------------------------------------------------------------------------------*
| <<< メタセコファイル読み込み時に可視情報をスキップするかの設定 >>>
|	入力	bSw = true  : 可視情報有効にする(デフォルト)
|				  false : 可視情報無効にする
*-------------------------------------------------------------------------------*/
extern	void	meta_visible_skip_set(BOOL bSw);

/*-------------------------------------------------------------------------------*
| <<< メタセコファイルを解析してバッファへ格納する >>>
|	入力	strFile	= 読み込みMQOファイル名
|	戻り値	true or	false
*-------------------------------------------------------------------------------*/
extern	BOOL	meta_buf_load(char *strFile);

/*-------------------------------------------------------------------------------*
| <<< メタセコファイルを読み込みだバッファ解放 >>>
*-------------------------------------------------------------------------------*/
extern	void	meta_buf_free(void);

/*-------------------------------------------------------------------------------*
| <<< meta_buf_load で読み込んだポリゴン数を返す >>>
|	戻り値	頂点数
*-------------------------------------------------------------------------------*/
extern	int		meta_buf_poly_count_get(void);

/*-------------------------------------------------------------------------------*
| <<< meta_buf_load のバッファから頂点・法線・UV 等を返す >>>
|	入力	iCount = バッファ番号
|	戻り値	頂点バッファのアドレス
*-------------------------------------------------------------------------------*/
extern	D3_VTX_DEFAULT	*meta_buf_vertex_get(int iCount);


#endif // __META_H

