
//--- アプリ名 ------------------------------------------------------------------------------------
#define	APP_NAME	"ボクサー佐々木"		// アプリ名
#define	VERSION		"2011.07.12"			// バージョン情報

//--- 定数 ----------------------------------------------------------------------------------------
#define HP_MAX		100.f					// デフォルトの体力値(エネミー、プレイヤー共通)

//--- モード --------------------------------------------------------------------------------------
enum
{
	MODE_TITLE,
	MODE_INFO,
	MODE_GAME,
	MODE_WIN,
	MODE_LOSE,
};
//--- テクスチャー --------------------------------------------------------------------------------
enum	TEX_ID
{
	TEX_MOJI,
	TEX_BACK,
	TEX_KO_BAR,
	TEX_TITLE,
	TEX_INFO,
	TEX_WIN,
	TEX_LOSE,
};

//--- サウンド番号 --------------------------------------------------------------------------------
enum	SND_ID
{
	SND_PUNCH,
	SND_OK,
	SND_WIN_LOSE,
	SND_GUARD,
	SND_ENE_DAMAGE,
	SND_PLY_DAMAGE,
};

//--- Ｘファイル ----------------------------------------------------------------------------------
enum	MESH_ID
{
	X_ENEMY,				// エネミー
	X_LEFT,					// 左グローブ
	X_RIGHT,				// 右グローブ
};

//--- インクルードファイル ------------------------------------------------------------------------
#include	"Game.h"
#include	"Camera.h"
#include	"Title.h"
#include	"Printf.h"
#include	"Player.h"
#include	"Enemy.h"

