//
//	ゲーム雛形
//

#include	"main.h"


// 共通ソース一式読み込み
#include	"_sys.cpp"

// ワーク定義
SYS_WORK	sys	= {APP_NAME" "VERSION, "HINAGATA(" VERSION ")"};

// 関数宣言
static	bool	ExEvent(HWND hw, UINT iMsg, WPARAM wParam, LPARAM lParam);



/*------------------------------------------------------------------------------*
| <<< 拡張ウィンドウイベント >>>			※ここでメニューの処理を行う
|	戻り値	true : リターン後の処理は行わない
*------------------------------------------------------------------------------*/
static	bool	ExEvent(HWND hw, UINT iMsg, WPARAM wParam, LPARAM lParam)
{
	switch(iMsg)
	{
	case WM_COMMAND:
		break;
	}
	return false;
}



/*------------------------------------------------------------------------------*
| <<< config.ini に保存する項目の設定 >>>
*------------------------------------------------------------------------------*/
void	ConfigSave(char *str)
{
};



/*------------------------------------------------------------------------------*
| <<< config.ini より項目を取り出す >>>
*------------------------------------------------------------------------------*/
void	ConfigLoad(char *str)
{
}



/*------------------------------------------------------------------------------*
| <<< 各種設定の初期化 >>>
*------------------------------------------------------------------------------*/
void	ConfigDefault(void)
{
}



/*------------------------------------------------------------------------------*
| <<< 終了メッセージ >>>
|	戻り値	false : 終了キャンセル(終了しない)
*------------------------------------------------------------------------------*/
bool	EndMessage(void)
{
	return true;
}

